
# 윤년관련 프로젝트 -> 어려워서 못했음

'''
주어진 연도가 윤년인지 아닌지를 반환하는 프로그램을 작성하세요. 결과는 True 또는 False여야 합니다.

평년은 365일이고, 윤년은 366일로 2월에 하루가 더 있습니다. 윤년이 있는 이유는 정말 매력적인데, 이 비디오가 더 잘 설명해줍니다.

특정 연도가 윤년인지 확인하는 방법입니다.

- 나머지가 없이 4로 나누어 떨어지는 모든 해에 해당합니다.

- 나머지가 없이 100으로 나누어 떨어지는 모든 해를 제외합니다.

- 단, 해당 연도가 400으로 나누어 떨어지는 경우는 제외합니다.

예. 2000년:

2000 ÷ 4 = 500 (Leap)  
2000 ÷ 100 = 20 (Not Leap)  
2000 ÷ 400 = 5 (Leap!)  
따라서 2000년은 윤년입니다.

그러나 2100년은 윤년이 아닙니다. 왜냐하면:

2100 ÷ 4 = 525 (Leap)  
2100 ÷ 100 = 21 (Not Leap)  
2100 ÷ 400 = 5.25 (Not Leap)

def is_leap_year(year):
    #윤년 확인

'''
